base/0.orig/fluid/microlayerProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "constant/fluid";
    object      microlayerProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../../constant/runParams"

// Initial Microlayer Thickness Model 

//initialMicrolayerThicknessModel linear;

//cSlope          0.001;

//initialMicrolayerThicknessModel powerLaw;

//coeff		0.0005510269532666392;
//pow		0.69;

initialMicrolayerThickness	landauLevichScriven;

variableCapillaryNum	1;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Dewetting Model Parameters

rhol			$rhol;
mul			$mul;
sigma			$sigma;
kappal 			$kappal;
cpl 			$cpl;
hfg 			$hfg;
Tsat			$Tsat;
Ri			$Ri;
thetaApp		$contactAngle;
theta0			$theta0;
A_theta			$A_theta;
b_theta			$b_theta;
ls			$ls;
growthConstant		$growthConstant;

Tw			$Tact;

bubbleRadius	$seedRadius;

contactLinePosition	$initialContactLinePosition;

maximumTimeStep 		$maximumTimeStep;

spread 			$spread;
spreadSolid		$spreadSolid;

microregionHeight	$microregionHeight;

microlayerLength	$initialMicrolayerLength;

desiredGridSize		$desiredGridSize;

contactLineVelocity	$contactLineVelocity;

bubbleFootRadiusOfCurvature	$initialBubbleFootRadiusOfCurvature;

initialMicrolayerThickness 	$initialMicrolayerThickness;	






// ************************************************************************* //
